#+TITLE: Pen
#+FILETAGS: pen PERSONAL @sideproject

*** WAITING waiting for discord to reply to my ticket about the fact that credentials used to create bots are incorrect. :WAITING:
:PROPERTIES:
:ID:       d6f143d4-c0d9-43ba-886d-a400c25ebbdb
:END:
:LOGBOOK:
- State "WAITING"    from "TODO"       [2022-04-09 Sat 11:17]
CLOCK: [2022-04-09 Sat 11:16]--[2022-04-09 Sat 11:17] =>  0:01
:END:
[2022-04-09 Sat 11:16]
[[file:~/org/community/blockchain/curated-blockchain-content-note.org::*Week 2 content][Week 2 content]]
check the following places for reply
- https://stackoverflow.com/questions/71809364/failed-to-complete-official-tutorial-from-discord-documentation
- https://www.reddit.com/r/discordapp/comments/tzv5de/failed_to_complete_official_tutorial_from_discord/
- discord ticket should be sent to my email.
**** TODO writing draft in blockchain section of Pen.el white paper.
:PROPERTIES:
:ID:       033c02c1-7326-4afd-bfe9-05ef988e4f14
:END:
:LOGBOOK:
CLOCK: [2022-04-03 Sun 00:36]--[2022-04-03 Sun 00:48] =>  0:12
:END:
[[https://www.youtube.com/watch?v=qHsPj0h-KSQ&ab_channel=ShaneMulligan][Pen.el - Prompt Engineering in Emacs overview]]
/mnt/c/Users/terng/Videos/pen.el/overview-penel-prompt-programming.webm
**** WAITING get api key for language models products. (see discussion with Shane to recall the name of the companies) :WAITING:
:PROPERTIES:
:ID:       4ede5fd4-3bff-4cff-a6c1-e9bf23376c33
:END:
:LOGBOOK:
- State "WAITING"    from "TODO"       [2022-04-14 Thu 20:07] \\
  waiting for shane to tell me list of api keys for language model that I need to have.
CLOCK: [2022-02-27 Sun 20:05]--[2022-02-27 Sun 20:06] =>  0:01
:END:
[2022-02-27 Sun 20:05]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*Several characteristics differentiate relations from ordinary tables or files. The first is that a relation is not sensitive to the ordering of tuples. The second involves the ordering of attributes in a relation schema and the corresponding ordering of values within a tuple. We gave an alternative definition of relation that does not require ordering of attributes, but we continued to use the first definition, which requires attributes and tuple values to be ordered, for convenience.][Several characteristics differentiate relations from ordinary tables or files. The first is that a relation is not sensitive to the ordering of tuples. The second involves the ordering of attributes in a relation schema and the corresponding ordering of values within a tuple. We gave an alternative definition of relation that does not require ordering of attributes, but we continued to use the first definition, which requires attributes and tuple values to be ordered, for convenience.]]
**** write out business plan required for me to execute pen.el start up plan. what does a founder need to know before starting a company? how to estimate value of the business? what is the time horizon (can I start doing it before starting the summer)? what do I need to know because deciding on the amount of money that pen.el need to continue the project? :WAITING:
:PROPERTIES:
:ID:       e972c7b7-ff36-47f3-ba8e-ce848a195b87
:END:
- State "WAITING"    from "TODO"       [2022-02-24 Thu 18:42] \\
  I need to map out purpose/principle/vision ( GTD methods) for my life and pen.el project (among other project) before begingin this step. actions should be postponeed until I can see my whole life at a higher level.
:LOGBOOK:
CLOCK: [2022-02-24 Thu 18:39]--[2022-02-24 Thu 18:41] =>  0:02
:END:
[2022-02-24 Thu 18:39]
[[file:~/org/notes/database-note.org::*ER][ER]]
**** TODO watch recorded video about "Sucessfully Start Up Your Business"
:PROPERTIES:
:ID:       0348c07e-f849-4ec6-b390-5512eb8e8648
:END:
:LOGBOOK:
CLOCK: [2022-04-13 Wed 15:16]--[2022-04-13 Wed 16:34] =>  1:18
:END:
[2022-04-13 Wed 15:16]
[[file:~/org/projects/sideprojects/pen.org::*Pen][Pen]]

*** WAITING join a Snapshot governance DAO to complete dao the rabbit hole tasks.. :WAITING:
:PROPERTIES:
:ID:       1bb01d35-72b7-4eef-9c42-12dc9b6a5929
:END:
:LOGBOOK:
- State "WAITING"    from "TODO"       [2022-04-17 Sun 10:25] \\
  waiting for moneny to transfer from bank of america to coinbase.
CLOCK: [2022-04-17 Sun 10:24]--[2022-04-17 Sun 10:26] =>  0:02
:END:
[2022-04-17 Sun 10:24]
[[file:~/org/refile.org::*pay for gnosis-safe creation.][pay for gnosis-safe creation.]]
**** how should semosis/me/pen.el/blockchain community be branded? should it all be under semeosis? or should each has its own brand?
:PROPERTIES:
:ID:       4e9d6989-708c-4732-9eae-b02db04006ea
:END:
:LOGBOOK:
CLOCK: [2022-04-12 Tue 18:09]--[2022-04-12 Tue 18:11] =>  0:02
:END:
[2022-04-12 Tue 18:09]
[[file:~/org/projects/sideprojects/pen.org::*1 hour read or learn about pen.el codebase + prompt programming + build pen community.][1 hour read or learn about pen.el codebase + prompt programming + build pen community.]]
